Revit 2026 API

# LinkOriginFileType Enumeration

---

Enum determining whether the source type of a temporary rvt link is an ifc.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LinkOriginFileType
```
```vb
Public Enumeration LinkOriginFileType
```
```cpp
public enum class LinkOriginFileType
```
```fsharp
type LinkOriginFileType
```

| Member name | Value | Description |
| --- | --- | --- |
| IFC | 1 | The original link file is an ifc file. |
| RVT | 0 | Default RVT, curently only support ifc. |

#### Reference

Autodesk.Revit.DB Namespace